app/controllers/lists_controller.rb

  def create
    @list = List.new(list_params)
    if @list.save
---
INSERT INTO "lists" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "投稿すると"], ["body", "詳細ページへ移動します"], ["created_at", "2022-04-04 01:24:45.602811"], ["updated_at", "2022-04-04 01:24:45.602811"]]

  def update
    list = List.find(params[:id])
    list.update(list_params)
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "lists" SET "body" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["body", "＠をつけ忘れるだけで大惨事"], ["updated_at", "2022-04-04 12:05:12.570413"], ["id", 7]]